app/controllers/emails_controller.rb

  def index
    @email = Email.all
---
SELECT "emails".* FROM "emails"

  def show
    @email = Email.find(params[:id])
    @email.update(:read => true)
---
SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "emails" SET "read" = $1, "updated_at" = $2 WHERE "emails"."id" = $3  [["read", true], ["updated_at", "2019-02-28 15:39:40.283583"], ["id", 4]]

  def destroy
    @email = Email.find(params[:id])
    if @email.destroy
---
SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "emails" WHERE "emails"."id" = $1  [["id", 9]]