app/controllers/home_controller.rb

  def index
    @tasks = Task.all
    @categories = Category.all
---
SELECT "tasks".* FROM "tasks"
SELECT "categories".* FROM "categories"