app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)
    @category = Category.find(category_params)
    @task.category = @category
    if @task.save
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "tasks" ("created_at", "updated_at", "title", "deadline", "category_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2019-02-27 13:13:48.614409"], ["updated_at", "2019-02-27 13:13:48.614409"], ["title", "Do stuff"], ["deadline", "2019-03-23 00:00:00"], ["category_id", 1]]

  def update
    @task = Task.find(params[:id])
    @task.update(task_params)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "deadline" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["deadline", nil], ["updated_at", "2019-02-27 14:38:43.971549"], ["id", 1]]

  def index
    @tasks = Task.all
    @categories = Category.all
---
SELECT "tasks".* FROM "tasks"
SELECT "categories".* FROM "categories"